In [1]:
import pandas as pd

In [2]:
url = 'https://tinyurl.com/titanic-csv'

In [24]:
dataframe = pd.read_csv(url)

In [25]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [5]:
dataframe = pd.DataFrame()

In [6]:
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])

In [7]:
new_person

Name      Molly Mooney
Age                 40
Driver            True
dtype: object

In [19]:
dataframe.append(new_person,ignore_index=True)

    Age  Driver          Name
0  40.0     1.0  Molly Mooney

In [23]:
dataframe.head(10)

Empty DataFrame
Columns: []
Index: []

In [26]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [27]:
url = 'https://tinyurl.com//titanic-csv'

In [28]:
dataframe = pd.read_csv(url)

In [29]:
dataframe.head(1)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

In [31]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [32]:
dataframe = dataframe.set_index(dataframe['Name'])

In [33]:
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [36]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] > 59)].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
"Bucknell, Mrs William Robert (Emma Eliza Ward)","Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.0,female,1,1
"Compton, Mrs Alexander Taylor (Mary Eliza Ingersoll)","Compton, Mrs Alexander Taylor (Mary Eliza Inge...",1st,64.0,female,1,1
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1
"Fortune, Mrs Mark (Mary McDougald)","Fortune, Mrs Mark (Mary McDougald)",1st,60.0,female,1,1

In [41]:
dataframe['SexCode'].replace(1,"One").head(5)

Name
Allen, Miss Elisabeth Walton                     One
Allison, Miss Helen Loraine                      One
Allison, Mr Hudson Joshua Creighton                0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    One
Allison, Master Hudson Trevor                      0
Name: SexCode, dtype: object

In [38]:
dataframe.head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [43]:
dataframe.rename(columns={'PClass': 'Passenger_Class'}).head(2)

,Name,Passenger_Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [44]:
dataframe.head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [45]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [46]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [47]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [49]:
dataframe['PClass'].unique()

array(['1st', '2nd', '*', '3rd'], dtype=object)

In [50]:
dataframe[dataframe['Age'].isnull()].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0

In [61]:
dataframe.drop_duplicates(subset=['Sex'])

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0

In [63]:
dataframe.groupby('Sex')['Age'].mean()

Sex
female    29.396424
male      31.014338
Name: Age, dtype: float64

In [65]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [67]:
dataframe['Name'].apply(lambda x : x.upper())[:2]

Name
Allen, Miss Elisabeth Walton    ALLEN, MISS ELISABETH WALTON
Allison, Miss Helen Loraine      ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [68]:
# Create DataFrame
employee_data = {'employee_id': ['1', '2', '3', '4'],
'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
'name'])
# Create DataFrame
sales_data = {'employee_id': ['3', '4', '5', '6'],
'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
'total_sales'])
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [71]:
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id',right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [89]:
df1 = pd.merge(dataframe_employees, dataframe_sales, on='employee_id',how='left')

In [90]:
df1['total_sales'].fillna(0.0)

0        0.0
1        0.0
2    23456.0
3     2512.0
Name: total_sales, dtype: float64

In [91]:
df1.fillna(0.0).head(5)

  employee_id        name  total_sales
0           1   Amy Jones          0.0
1           2  Allen Keys          0.0
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0